vvpai9/Keil/Keil_v5/ARM/Pack/.Web/DialogSemiconductor.DA1470x_DFP.pdsc
			<device Dname="DA14708">
                <book name="http://infocenter.arm.com/help/topic/com.arm.doc.100235_0004_00_en/index.html" title="Cortex-M33 Device Generic Users Guide"/>
				<book name="Documents/DA1470x_Datasheet_3v0.pdf" title="DA1470x - Data Sheet"/>  
				<description>The DA14708 has a SRAM of 1,5 MB with retention capabilities, upto 79 Configurable GPIO pins and a 2D GPU, JDI/MIPI display interface with 2 lanes, JEITA Charger, a boost DCDC convertera SDIO/eMMC interface and external PSRAM support with data cache</description>
                <compile header="Device/Include/DA1470x.h"/>
                <compile header="Device/Include/DA1470x-00.h"/>
                <compile header="Device/Include/system_DA1470x.h"/>
				<debug  svd="Device/SVD/da1470x.svd"/>
				<memory name="IROM1" access ="rx" start="0x00000000" size="0x10000"  startup="1" default="1"/>
				<memory name="IRAM1" access ="rw" start="0x20000000" size="0x180000" init="0"    default="1"/>
			</device>
			
		</family>
		
    </devices>
  <!-- conditions section (optional for all Software Packs)-->
  
    <conditions>
        <condition id="CMSIS-Core">
          <description>True if the component Device Startup is selected</description>
          <require Cclass="Device" Cgroup="Startup"/>
        </condition>
       
      	<!-- Compiler Conditions -->
        <condition id="ARM Compiler">
          <require Tcompiler="ARMCC"/>
        </condition>
        <condition id="IAR Compiler">
          <require Tcompiler="IAR"/>
        </condition>
        <condition id="GCC Compiler">
          <require Tcompiler="GCC"/>
        </condition>
        
   		<condition id="DA1470x">
			<!-- conditions selecting Devices -->
			<description>Dialog Semiconductor DA1470x Series devices</description>
			<accept Dvendor="Dialog Semiconductor:113" Dname="DA1470x"/>
		</condition>		

   		<condition id="DA14701">
			<!-- conditions selecting Devices -->
			<description>Dialog Semiconductor DA14701 device</description>
			<accept Dvendor="Dialog Semiconductor:113" Dname="DA14701"/>
		</condition>		

   		<condition id="DA14705">
			<!-- conditions selecting Devices -->
			<description>Dialog Semiconductor DA14705 device</description>
			<accept Dvendor="Dialog Semiconductor:113" Dname="DA14705"/>
		</condition>		

   		<condition id="DA14706">
			<!-- conditions selecting Devices -->
			<description>Dialog Semiconductor DA14706 device</description>
			<accept Dvendor="Dialog Semiconductor:113" Dname="DA14706"/>
		</condition>		
        
   		<condition id="DA14708">
			<!-- conditions selecting Devices -->
			<description>Dialog Semiconductor DA14708 device</description>
			<accept Dvendor="Dialog Semiconductor:113" Dname="DA14708"/>
		</condition>		

	    <!-- DA1470x Conditions -->
		<condition id="DA1470x device Main core and CMSIS">
		  <!-- defines the condition with the ID "CMSIS-CORE" -->
            <description>Dialog Semiconductor DA14701 CMSIS Main device</description>
            <require condition="CMSIS-Core"/>
            <require condition="DA1470x"/>
            <require Dvendor="Dialog Semiconductor:113" Dname="DA1470x" Pname="Main"/>
		</condition>
		<condition id="DA1470x device SNC core and CMSIS">
		  <!-- defines the condition with the ID "CMSIS-CORE" -->
            <description>Dialog Semiconductor DA14701 CMSIS SNC device</description>
            <require condition="CMSIS-Core"/>
            <require condition="DA1470x"/>
            <require Dvendor="Dialog Semiconductor:113" Dname="DA1470x" Pname="SNC"/>
		</condition>

	    <!-- DA14701 Conditions -->
		<condition id="DA14701 device Main core and CMSIS">
		  <!-- defines the condition with the ID "CMSIS-CORE" -->
            <description>Dialog Semiconductor DA14701 CMSIS Main device</description>
            <require condition="CMSIS-Core"/>
            <require condition="DA14701"/>
            <require Dvendor="Dialog Semiconductor:113" Dname="DA14701" Pname="Main"/>
		</condition>
		<condition id="DA14701 device SNC core and CMSIS">
		  <!-- defines the condition with the ID "CMSIS-CORE" -->
            <description>Dialog Semiconductor DA14701 CMSIS SNC device</description>
            <require condition="CMSIS-Core"/>
            <require condition="DA14701"/>
            <require Dvendor="Dialog Semiconductor:113" Dname="DA14701" Pname="SNC"/>
		</condition>

	    <!-- DA14705 Conditions -->
		<condition id="DA14705 device Main core and CMSIS">
		  <!-- defines the condition with the ID "CMSIS-CORE" -->
            <description>Dialog Semiconductor DA14705 CMSIS Main device</description>
            <require condition="CMSIS-Core"/>
            <require condition="DA14705"/>
            <require Dvendor="Dialog Semiconductor:113" Dname="DA14705" Pname="Main"/>
		</condition>
		<condition id="DA14705 device SNC core and CMSIS">
		  <!-- defines the condition with the ID "CMSIS-CORE" -->
            <description>Dialog Semiconductor DA14705 CMSIS SNC device</description>
            <require condition="CMSIS-Core"/>
            <require condition="DA14705"/>
            <require Dvendor="Dialog Semiconductor:113" Dname="DA14705" Pname="SNC"/>
		</condition>

	    <!-- DA14706 Conditions -->
		<condition id="DA14706 device Main core and CMSIS">
		  <!-- defines the condition with the ID "CMSIS-CORE" -->
            <description>Dialog Semiconductor DA14706 CMSIS Main device</description>
            <require condition="CMSIS-Core"/>
            <require condition="DA14706"/>
            <require Dvendor="Dialog Semiconductor:113" Dname="DA14706" Pname="Main"/>
		</condition>
		<condition id="DA14706 device SNC core and CMSIS">
		  <!-- defines the condition with the ID "CMSIS-CORE" -->
            <description>Dialog Semiconductor DA14706 CMSIS SNC device</description>
            <require condition="CMSIS-Core"/>
            <require condition="DA14706"/>
            <require Dvendor="Dialog Semiconductor:113" Dname="DA14706" Pname="SNC"/>
		</condition>

	    <condition id="Startup">
            <description>Startup Component selected.</description>
            <require condition="CMSIS-Core"/>
            <accept Dvendor="Dialog Semiconductor:113" Dname="*"/>
        </condition>

