vvpai9/Keil/Keil_v5/ARM/Pack/.Web/DialogSemiconductor.DA1470x_DFP.pdsc
		<component Cclass="Device" Cversion="1.0.0" Cgroup="Startup" condition="DA14705 device SNC core and CMSIS">
			<description>System startup for Dialog Semiconductor DA14705 device</description>
			<files>
				<file category="include" name="Device/Include/"/>
                <file category="header"  name="Device/Include/sdk_defs.h"                                  version="1.0.0"/>
                <file category="header"  name="Device/Include/bsp_definitions.h"                           version="1.0.0"/>
                <file category="header"  name="Device/Include/bsp_device_definitions.h"                    version="1.0.0"/>
                <file category="header"  name="Device/Include/bsp_device_definitions_internal.h"           version="1.0.0"/>
                <file category="header"  name="Device/Include/DA1470x.h"                                   version="1.0.0"/>
                <file category="header"  name="Device/Include/DA1470x-00.h"                                version="1.0.0"/>
                <file category="sourceC" name="Device/Source/per_ex_hard_fault.c"            attr="config" version="1.0.0"/>
                <file category="sourceC" name="Device/Source/system_da1470x-snc.c"           attr="config" version="1.0.0"/>
                <file category="header"  name="Device/Include/system_DA1470x.h"                            version="1.0.0"/>
                <file category="header"  name="Device/Include/DataAccess.h" 	                           version="1.0.0"/>

                <file category="source"  name="Device/Source/ARM/arm_startup_da1470x-snc.S"      attr="config" version="1.0.0" condition="ARM Compiler"/>
                <file category="source"  name="Device/Source/ARM/arm_deepsleep-snc.S"            attr="config" version="1.0.0" condition="ARM Compiler"/>
                <file category="source"  name="Device/Source/ARM/arm_exception_handlers-snc.S"   attr="config" version="1.0.0" condition="ARM Compiler"/>
                <file category="source"  name="Device/Source/ARM/arm_vector_table_da1470x-snc.S" attr="config" version="1.0.0" condition="ARM Compiler"/>

                <file category="source"  name="Device/Source/GCC/gcc_startup_da1470x-snc.S"      attr="config" version="1.0.0" condition="GCC Compiler"/>
                <file category="source"  name="Device/Source/GCC/gcc_deepsleep-snc.S"            attr="config" version="1.0.0" condition="GCC Compiler"/>
                <file category="source"  name="Device/Source/GCC/gcc_exception_handlers-snc.S"   attr="config" version="1.0.0" condition="GCC Compiler"/>
                <file category="source"  name="Device/Source/GCC/gcc_vector_table_da1470x-snc.S" attr="config" version="1.0.0" condition="GCC Compiler"/>

                <file category="source"  name="Device/Source/IAR/iar_startup_da1470x-snc.S"      attr="config" version="1.0.0" condition="IAR Compiler"/>
                <file category="source"  name="Device/Source/IAR/iar_deepsleep-snc.S"            attr="config" version="1.0.0" condition="IAR Compiler"/>
                <file category="source"  name="Device/Source/IAR/iar_exception_handlers-snc.S"   attr="config" version="1.0.0" condition="IAR Compiler"/>
                <file category="source"  name="Device/Source/IAR/iar_vector_table_da1470x-snc.S" attr="config" version="1.0.0" condition="IAR Compiler"/>
			</files>		
		</component>


		<component Cclass="Device" Cversion="1.0.0" Cgroup="Startup" condition="DA14706 device Main core and CMSIS">
			<description>System startup for Dialog Semiconductor DA14706 device</description>
			<files>
				<file category="include" name="Device/Include/"/>
                <file category="header"  name="Device/Include/sdk_defs.h"                                  version="1.0.0"/>
                <file category="header"  name="Device/Include/bsp_definitions.h"                           version="1.0.0"/>
                <file category="header"  name="Device/Include/bsp_device_definitions.h"                    version="1.0.0"/>
                <file category="header"  name="Device/Include/bsp_device_definitions_internal.h"           version="1.0.0"/>
                <file category="header"  name="Device/Include/DA1470x.h"                                   version="1.0.0"/>
                <file category="header"  name="Device/Include/DA1470x-00.h"                                version="1.0.0"/>
                <file category="sourceC" name="Device/Source/per_ex_hard_fault.c"            attr="config" version="1.0.0"/>
                <file category="sourceC" name="Device/Source/system_DA1470x.c"               attr="config" version="1.0.0"/>
                <file category="header"  name="Device/Include/system_DA1470x.h"                            version="1.0.0"/>
                <file category="header"  name="Device/Include/DataAccess.h" 	                           version="1.0.0"/>
                
                <file category="source"  name="Device/Source/ARM/arm_startup_da1470x.S"             attr="config" version="1.0.0" condition="ARM Compiler"/>
                <file category="source"  name="Device/Source/ARM/arm_deepsleep.S"                   attr="config" version="1.0.0" condition="ARM Compiler"/>
                <file category="source"  name="Device/Source/ARM/arm_exception_handlers.S"          attr="config" version="1.0.0" condition="ARM Compiler"/>
                <file category="source"  name="Device/Source/ARM/arm_vector_table_da1470x.S"        attr="config" version="1.0.0" condition="ARM Compiler"/>

                <file category="source"  name="Device/Source/GCC/gcc_startup_da1470x.S"             attr="config" version="1.0.0" condition="GCC Compiler"/>
                <file category="source"  name="Device/Source/GCC/gcc_vector_table_da1470x.S"        attr="config" version="1.0.0" condition="GCC Compiler"/>
                <file category="source"  name="Device/Source/GCC/gcc_deepsleep.S"                   attr="config" version="1.0.0" condition="GCC Compiler"/>
                <file category="source"  name="Device/Source/GCC/gcc_exception_handlers.S"          attr="config" version="1.0.0" condition="GCC Compiler"/>

                <file category="source"  name="Device/Source/IAR/iar_startup_da1470x.S"             attr="config" version="1.0.0" condition="IAR Compiler"/>
                <file category="source"  name="Device/Source/IAR/iar_deepsleep.S"                   attr="config" version="1.0.0" condition="IAR Compiler"/>
                <file category="source"  name="Device/Source/IAR/iar_exception_handlers.S"          attr="config" version="1.0.0" condition="IAR Compiler"/>
                <file category="source"  name="Device/Source/IAR/iar_vector_table_da1470x.S"        attr="config" version="1.0.0" condition="IAR Compiler"/>
			</files>		
		</component>
        
